app/views/restrooms/show.html.erb

SELECT 1 AS one FROM "reviews" WHERE "reviews"."restroom_id" = $1 LIMIT 1  [["restroom_id", 1]]
---

<% if @restroom.reviews.any? %>