app/controllers/restrooms_controller.rb

  def search
    @params = params[:search]
    @restrooms = Restroom.search(params[:search])
     if @restrooms.empty?
---
SELECT COUNT(*) FROM "restrooms" WHERE (zip LIKE '%02166%')