app/controllers/restrooms_controller.rb

  def create
    @restroom = Restroom.new(restroom_params)
    if @restroom.save
---
INSERT INTO "restrooms" ("city", "created_at", "line1", "line2", "name", "state", "updated_at", "zip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def index
    @restrooms = Restroom.paginate(page: params[:page])
---
SELECT "restrooms".* FROM "restrooms" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "restrooms"

  def show
    @restroom = Restroom.find(params[:id])
    @reviews = @restroom.reviews.paginate(page: params[:page])
---
SELECT "restrooms".* FROM "restrooms" WHERE "restrooms"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."restroom_id" = $1 LIMIT 30 OFFSET 0  [["restroom_id", 3]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."restroom_id" = $1  [["restroom_id", 3]]

  def search
    @params = params[:search]
     #add validations for search form
    @restrooms = Restroom.search(params[:search])
---
SELECT "restrooms".* FROM "restrooms" WHERE (zip LIKE '%02116%')