app/controllers/reviews_controller.rb

SELECT "restrooms".* FROM "restrooms" WHERE "restrooms"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def new
	@restroom = Restroom.find(params[:restroom_id])

SELECT "restrooms".* FROM "restrooms" WHERE "restrooms"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "reviews" ("author", "content", "created_at", "restroom_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
  	@restroom = Restroom.find(params[:restroom_id])
    @review = @restroom.reviews.build(review_params)
    @review.author = current_user.email
    if @review.save