app/views/reviews/_review.html.erb

<ul class="single_review">
  <li class="review_auth"><%= link_to review.author,
  			user_path(User.find_by email: review.author) %></li>
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'dd' LIMIT 1